# IfcExportElementTypeAs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcExportElementTypeAs Property
ParameterTypeId Class See Also
---
"Export Type to IFC As"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcExportElementTypeAs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcExportElementTypeAs As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcExportElementTypeAs {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace